interface Topic {
  title: string;
  description: string;
  details: string;
  link: string;
}

const topics: Topic[] = [
  {
      title: 'مقدمة في اللغة الإسبانية',
      description: 'تعلم أساسيات اللغة الإسبانية.',
      details:
          'اللغة الإسبانية هي واحدة من أكثر اللغات انتشارًا في العالم. تعلم الأساسيات، مثل القواعد الأساسية، والمفردات، والنطق، يمكن أن يساعدك في التواصل بفعالية. كما أنها لغة رسمية في 21 دولة حول العالم.',
      link: 'https://youtube.com/playlist?list=PLv63dFTP4Sjq6knRsZQI-bTnRE38cZZoy&feature=shared',
  },
  {
      title: 'المفردات',
      description: 'قم بتوسيع معرفتك بالكلمات الإسبانية.',
      details:
          'يعد بناء المفردات أمرًا أساسيًا في تعلم أي لغة، حيث يتضمن تعلم المرادفات، والمتضادات، والتعابير الاصطلاحية، مما يساعد في تحسين الطلاقة والتواصل. الإسبانية تحتوي على كلمات متشابهة مع الإنجليزية والفرنسية، مما يسهل تعلمها.',
      link: 'https://youtu.be/0Odnbvov9N0?feature=shared',
  },
  {
      title: 'النطق',
      description: 'إتقان نطق اللغة الإسبانية.',
      details:
          'تعلم النطق الصحيح يشمل معرفة الصوتيات الإسبانية، والتنغيم، والتوكيد، مما يساعد في تحسين مهارات التحدث. اللغة الإسبانية تُنطق كما تُكتب تقريبًا، مما يجعلها أسهل من بعض اللغات الأخرى.',
      link: 'https://youtu.be/Sh7MLrbxH2E?feature=shared',
  },
  {
      title: 'القواعد',
      description: 'تعلم قواعد اللغة الإسبانية.',
      details:
          'تغطي القواعد الإسبانية الأزمنة، وتركيب الجمل، وأجزاء الكلام، مما يعزز من قدرتك على الكتابة والتحدث بوضوح. القواعد الإسبانية شبيهة باللغات الرومانسية الأخرى مثل الفرنسية والإيطالية.',
      link: 'https://youtu.be/EWbr86CdCsI?feature=shared',
  },
  {
      title: 'الاستماع',
      description: 'طور مهارات الاستماع لديك.',
      details:
          'تدريبات الاستماع تشمل الحوارات، والبودكاست، وتمارين الفهم، مما يساعد على تحسين الفهم السماعي. الاستماع إلى الأغاني والمحادثات اليومية يعزز الاستيعاب السريع.',
      link: 'https://youtu.be/0LzHR1BQj0E?feature=shared',
  },
  {
      title: 'التحدث',
      description: 'عزز طلاقتك في التحدث.',
      details:
          'يتطلب تحسين مهارات التحدث ممارسة المحادثات اليومية، والتفاعل مع الناطقين الأصليين، والمشاركة في المناقشات. يمكنك استخدام تطبيقات تبادل اللغات لممارسة التحدث بانتظام.',
      link: 'https://youtube.com/playlist?list=PLHWAe4rFdBzywL8nk3E9_vPQreR0qqx6K&feature=shared',
  },
  {
      title: 'القراءة',
      description: 'حسن مستوى فهمك للقراءة.',
      details:
          'تطوير مهارات القراءة يتضمن قراءة القصص، والمقالات، والكتب التعليمية، مما يساعد في توسيع المعرفة وتحسين الفهم. يفضل البدء بقراءة النصوص البسيطة ثم التدرج إلى المستويات الأعلى.',
      link: 'https://snappyspanish.com/beginner-spanish-stories/',
  },
  {
      title: 'الكتابة',
      description: 'حسن مهاراتك في الكتابة.',
      details:
          'تشمل الكتابة إنشاء المقالات، والرسائل، والتعبير الإبداعي، مما يعزز من قدرتك على التعبير بشكل واضح ومنظم. يمكن تحسين الكتابة عبر ممارسة كتابة اليوميات أو القصص القصيرة.',
      link: 'https://youtu.be/cvJTy6ulL_4?feature=shared',
  },
];

export default topics;